Fluent Python Reading Summary

从2020年8月27日到9月22日，完成了fluent python的第一次阅读。 说是完成，其实有一部分内容是完全跳过的。 跳过的内容有：第四章：Text versus Bytes
第十二章：inheritance 第十三章：Operator overloading 以及第18，19，20，21章节。

之所以跳过这些章节，主要原因是自己能力有限水平不够，确实看不懂作者想表达的内容。尤其在最后4个章节，连doctest都不再是我能读懂的范畴。之前的几个章节，跳过的原因是不太会涉及或用到这些知识：1.继承：我目前很少自定义class，所以更不要说继承自己定义的类，或者继承build-in。2.Bytes：这章节更多讲述了如何处理比较复杂的字符，比如法语字母，拉丁文，希腊文字，在这些地方我的涉及是几乎为零。3.运算符重载：again，我目前很少会去自定义类，更不要说让自定义的类进行计算。

总之，fluent python 是一本很好的书，我觉得我可能第一次学习到了它全部内容的百分之四五十，都不一定有那么多。 但光是这百分之五十已经让我大开眼界，让我知道了原来python还可以这样做那样做。

最后，我想说的是，在自学的过程中肯定会遇到很多疑问，不仅是对问题的，也有可能对自己的。‘我能不能找到这方面工作’，‘有人会要我吗’，‘我是不是太笨了理解不了这门语言’----不要气馁，坚持下去。


                                                        刘洋  2020年9月22日

